package com.example.ali.myapplication;

import android.content.Intent;
import android.support.annotation.NonNull;
import android.support.annotation.Nullable;
import android.support.design.widget.TabLayout;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentManager;
import android.support.v4.app.FragmentPagerAdapter;
import android.support.v4.app.FragmentTransaction;
import android.support.v4.view.ViewPager;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.text.Html;
import android.text.method.ScrollingMovementMethod;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.FrameLayout;
import android.widget.HorizontalScrollView;
import android.widget.ImageView;
import android.widget.ScrollView;
import android.widget.TableLayout;
import android.widget.TextView;
import android.widget.Toast;
import android.widget.Toolbar;

public class InformationActivity extends AppCompatActivity {
    TextView t1, t2;
Button goToMainActivity,goToRegisterActivity,goToSettingActivity;
String g="";
    String g2="";
String line1="التبرع بالدم:\n" +

        "هو اجراء طبي يكمن في نقل دم من شخص سليم معافى طوعا الى خص مرض يحتاج للدم.\n" +
        " يستخدم ذلك الدم في عمليات نقل الدم او تصنيع الادوية . و ذلك عن طرق عملية تسمى التجزيء.\n" +
        "يتم اجراء التبرع بالدم عن طريق جمع الدم في كيس طبي يحتوي على مادة مانعة للتجلط متصل بأبر معقمة ، \n" +
        "تستخدم لمرة واحدة فقط توصل من الوريد في الذراع.\n" +
        " و تتم عملية التبرع بالدم في فترة زمنية مدتها بين 5 الى 10 دقائق في هذه الفترة يكون المتبرع تحت الرعاية الطبية المباشرة.\n";
   String line2="يتم اخذ من 400 الى 450 مليلترا ، " +
           "وهو ما يمثل حوالي 12/1 من حجم الدم الموجود داخل جسم كل انسان ، والذي يتراوح مابيم 5 الى 6 لترات.\n" +
           " يمكن معاودة التبرع بالدم بعد مرور 6 اشهر من اخر تبرع بالدم في حين انه لتكرار التبرع يمكن التبرع بلدم قبل ذلك في الفترةمن 3_4 اشهر ،\n" +
           " ولكن يجب ان يكون المتبرع في وضع صحي لقائق يجب ان يبقى المتبرع على سرير التبرع لمدة 5 دقائق تحت الملاحظة الطبية \n" +
           "و يسمح له بالجلوس بعد التأكد من حالته الطبية \n";
   String line3="سلامة المستلم :\n" +
           "يتم الكشف طبيا على المخاطر الصحية التي يمكن ان تجعل عملية التبرع غير امنة للمستلم .\n " +
           "بعض هذه القيود مثيرة للجدل و يعتبرها البعض عنصرية ،\n " +
           "مثل تقييد التبرعات من الرجال الذين يمارسون الجنس مع الرجال لخطر فيروس نقص المناعة البشرية .\n" +
           " أما في عملية الهبة الذاتية، فلا تفرض قيود مشددة على سلامة الدم حيث ان المتبرع هو الذي سيحصل على دمه لاحقا ولا شخص سواه. \n" +
           "يسئل أيضا المتبرع عن ما ااذا كان يتعاطى أي نوع من الادوية ،\n " +
           "حيث ان بعض الادوية قد تضر او تشكل خطرا على الشخص المستلم و خاصة النساء الحوامل.\n" +
           " و يتم فحص المتبرعون للاشارات و اعراض الامراض التي يمكن ان تنتقل بنقل الدم . \n" +
           "مثل فيروس نقص المناعة البشرية و الملاريا والتهاب الكبد الفيروسي .\n " +
           "وقد يمتد الفحص الى الأسئلة يسئلها الاخصائي حول عوامل الخطر للعديد من الامراض .\n " +
           "مثل السفر الى البلدان المعرضة للملاريا او مرض كروتزفيلد جاكوب (اللانموذجي ).\n" +
           "وتختلف هذه الأسئلة من بلذ الى اخر .\n " +
           "فعلى سبيل المثال، قد تجرئ منظمة انكيبيك بمقتطعة كيبك الكندية المتبرعون الذين كانو يعيشون في المملكة المتحدة لخطر مرض جاكوب . \n" +
           "بينما في المملكة المتحدة نفسها لا يتم اخذ المرض بعين الاعتبار الا في حالة ان يكون المتبرع قد تعرض لعملية نقل دم داخل المملكة المتحدة نفسها.\n";

 String line4="سلامة المتبرع:\n" +
         "يخضع المتبرع أيضا لفحص و يسأل أسئلة معينة حول تاريخه الطبي للتأكد من ان عملية التبرع بالدم لن تشكل أي خطر على صحة المتبرع.\n " +
         "و يختبر مستوى الهيماتوكريت و خضاب الدم في دم المتبرع للتأكد من ان عملية التبرع لن تسببب حالة فقر دم للمريض .\n" +
         "و تعتبر نتائج هذا الاختبار هي الأكثر شيوعا لجعل المتبرع غير مؤهل للتبرع . \n" +
         "ويتم اخذ النبض و ضغط الدم و حرارة الجسم في عين الاعتبار اثناء التقيم .\n" +
         "و أحيانا يتم رفض المتبرعون المسنون لمخاوف صحية.\n" +
         " ولم يتم حتى الان دراسة مدى سلامة التبرع اثتاء فترة الحمل بشكل واف، لذلك عادة ما يؤجل النساء الحوامل اثناء الحمل. \n";
String line5="قبل اجراء عملية التبرع ::\n" +
        "يتم اختبار المتبرع بالدم من خلال معايير محددة من الفحص الطبي و المخبري و التاريخ المرضي حيث يتم :\n" +
        "1_تحديد فصيلة الدم : (من الفصائل الأربعة المتعارف عليها ).\n" +
        "2_قياس تركيز الهيموجلوبين (خضاب الدم) : عن طريق الاصبع .\n" +
        "3_قياس النبض ضغط الدم : اقل من 160/90\n" +
        "4_ يجب ان لا يقل عن 60 كغ\n";
String line6="عادة مايطلب من المانحون إعطاء موافقة خطية قبل القيام بعملية التبرع، لذلك لا يمكن للقاصر التبرع بالدم من دون موافقة الوالدين.\n" +
        "مراعاة للسرية، تقوم بعض البلدان بربط معلومات عملية التبرع بنوع الدم و بدون اسم الشخص .\n" +
        "و في دول أخرى مث الولايات المتحدة تستخدم السلطات الأسماء لعمل قوائم للمتبرعين الغير مؤهلين للتبرع . \n" +
        "يطلق على المتبرع الذي لا يوافق شروط و معايير التبرع لقب يسمى متبرع مؤجل يطلق ذلك اللقب حيث يكون غالبا سبب المنع من التبرع مؤقت و يزول في وقت لاحق. \n" +
        "يعتبر جنس المتبرع أو خلفيته العرقية مهمة أحيانا حيث ان فصائل الدم و خاصة الفصائل النادرة تكون شائعة لدى كثير من أبناء العرق الواحد .\n" +
        " و تاريخيا في بعض الدول لديها قوانين حيث يكون التبرع على أساس الجنس ،\n " +
        "الدين،او الانتماء العرقي ، لكن هذه القوانين ليست مشكلة للمنطق الطبي ولا تعتبر مقاسا علميا .\n";
  String line7="بعد اجراء عملية التبرع :\n" +
          "الاكثار من شرب السوائل خلال الساعات التالية للتبرع .\n " +
          "الامتناع عن التدخين لمة ساعتين .\n" +
          " عدم نزع اللاصق الضاغط على مكان الابرة قبل ساعتين . يجب رفع اليدين الى اعلى و الضغط على مكان الابرة اذا كان هناك نزيف.\n " +
          "اذا شعر المتبرع بالغثيان او الدوران يجب ان يستلقي على السرير و يكون مستوى الرأس منخفض عن الجسم او الجلوس مع وضع الرأس بين الركبتين لمدة خمس دقائق \n" +
          " عدم القيام بأعمال شاقة او تمرينات رياضية مجهدة لمدة 24 ساعة .\n" +
          "في اغلب الأحيان يكون معظم المتبرعين  هم من المتطوعين الذين يتبرعون مجانا اما لأغراض إنسانية او اجتماعية او دينية او حتى صحية .\n " +
          "تهتم جهات التبرع بالدم بأي سبب قد يجعل من دم المتبرع غير صالح او غير أمن على الشخص المتيرع له ." +
          "يتم فحص الدم عن طريق فحص الامراض التي يمكن ان تنتقل عن طريق نقل الدم . بما في ذلك فيروس نقص المناعة البشرية و التهاب الكبد الوبائي \n" +
          "ويتم  أيضا سؤال المتبرع عن تاريخه الطبي و اخضاعه لاختبارات فحص قصيرة للتأكد من ان التبرع لا يشكل أي خطر على صحته . \n" +
          ". وتختلف مدة الانتظار بينالتبرع والأخر للفرد بين أيام و اشهر .\n" +
          " و ذلك على حسب نوع التبرع  (و وذلك ان كان جزئي او كلي ) وتختلف أيضا على حسب قوانين البلد التي يتبرع فيها المتبرع . \n" +
          "فعلى سبيل المثال يجب على المتبرع في الولايات المتحدة الانتظار لمة 8 أسابيع بين التبرع الكامل بالدم ، و ثلاثة أيام ان كان التبرع بالصفائح الدموية فقط.\n " +
          "و تختلف كميات و أساليب سحب الدم و لكن يعتبر التبرع ب 500 مل( نصف لتر) هو الأكثر شيوعا لعمليات التبرع بالدم الكامل . \n" +
          "و تشترط جميع جهات التبرع مواصفات طبية عالية للمحافظة على نظافة و تعقيم الأدوات المستعملة في العملية ،\n" +
          " التي تكون اغلبها ذات اجل قصير ، مما يسبب ذلك مشكلة في إيصال التجهيزات في الأماكن البعيدة \n";

String line8="_انواع التبرع بالم:\n" +
        "تقسم عملبة التبرع بالدم للعديد من المجموعات على أساس من هو الشخص المتلقي للدم .\n" +
        " التبرع الوراثي هو التبرع عندما ينبرع المتبرع بالدم لتخزينه في بنك الدم لاحقا لشخ صغالبا ما يكون مجهول .التبرع المباشر و يتبرع المتبرع و غالبا يكون من الاسرة الى خص معين .\n" +
        " و يكل التبرع المباشر نسبة ضئيلة من تبرعات الدم في العالم و عادة ما يتناوب التبرع المباشر على فردين او اكثر، و تنتشر هذ الظاهر في دول كثيرة مثل غانا،\n" +
        " و يتم التبرع المباشر عن طريق تبرع وقتي بتحويل الدم من المتبرع للمريض و يشتغنى عن الدم المخزن وذلك لوجود امداد دم وقتي و توفير الدم المخزن لمرض اخر.\n " +
        "وهناك أيضا التبرع الذاتي (الهبة الذاتية) وتكون عندما يخزن المتبرع لنفسه دما قبل اجرائ عملية جراحية مثلا، لنقلها له في وقت لاحق اثناء الجراحة او بعدها.\n " +
        "اما الادروية التي تصنع من الدم فيلجأ مصنعو الادوية غالبا الى التبرع الوراثي او في بعض الأحيان توظف الشركات أشخاصا لغرض استخدام دمائهم.\n" +
        " تختلف عملية نقل الدم الفعلية وفقا لقوانين البلد و تتفاوت التوصيات المقدمة الى المتبرع وفقا للمنظمة نفسها\n" +
        " و قد أصدرت منظمة لصحة العالمية توصيات لوضع سياسيات لعميات التبرع بالدم في جميع انحاء العالم و لكن الكثير من البلدان النامية لم تتبع تلك التوصيات نظرا لتكلفتها العالية فعلى\n" +
        " سبيل المثال اوصت المنظمة بمختبرات مجهزة طبيا ، فريق مدرب و كواشف خاصة للدم والتي تكون غير متوفرة او مكلفة جدا لتلك الدول النامية .\n" +
        " تنظم المؤسسات المعنية بالتبرع بالدم جملات تبرع تقوم على أساس التبرع الوراثي. و تسمى مواسم التبرع بالدم .\n";
String line9="في اغلب البلدان تنظم بموك الدم تجمعات في أماكن العبادة و الجامهات و الشركات والأسواق اللتجارية حملات تبرع .اناوع التبرع بالدم تتم بثلاثة طرق و هي :\n" +
        "1_ التبرع بالدم الكامل : ويقسم الى \n" +
        "+التبرع بالدم المماثل : المتبرع والتلقي شخصان مختلفان لا يعرفان بعضهما.وهو الأكثر شيوعا وانتشارا.\n" +
        "+التبرع بالدم الذاتي : و يتمثل في سحب دم المريض و إعادة حقنه له عند الحاجة و يتم اللجوء الى هذه الطريقة عند القيام ببعض العمليات الجراحية المبرمجة من قبل.\n" +
        " و من فوائدها التقليل الى اقصى حد ، من العوارض الناجمة أحيانا من جراء نقل الدم والتمكن من الاقتصاد في المكونات الدموية .\n" +
        "و هذا النةع من التبرع يخضع الى روط خصوصية .\n" +
        "\n" +
        "2_ التبرع بالبلازما عن طريق الفصادة : تتمثل هذه الطريقة في سحب كمية من البلازما من المتبرع بواسطة الة خاصة و ترجع اليه كل الخلايا الدموية .\n" +
        "\n" +
        "3_قياس النبض :ضغط الدم:اقل من 160/90\n" +
        "التبرع بالخلايا عن طريق الفصادة : بعكس فصادة البلازما ، تتمثل هذه الطريقة في سحب الخلايا الدموية من المتبرع بواسطة الة فصادة وترجع اليه المكونات الأخرى للدم .\n " +
        "ان تبرعا واحدا من الصفيحات عن طريق فصادة الخلايا يعوض 12 تبرعا من الدم الكامل .\n";
   @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_information);
        t1=findViewById(R.id.textView6);
     //   t1.setMovementMethod(new ScrollingMovementMethod());
       //android:scrollbars="vertical"
       Intent i=getIntent();
       g=i.getStringExtra("return");
       g2=i.getStringExtra("k");
        t1.setText(Html.fromHtml("<font color='red'>"+line1+"<br>"+line2+"<br>"+line3+"<br>"+line4+"<br>"+line5+"<br>"+line6+"<br>"+line7+"<br>"+line8+"<br>"+line9+"</font><br>"));
        goToMainActivity=findViewById(R.id.button);
        goToRegisterActivity=findViewById(R.id.button2);
        goToSettingActivity=findViewById(R.id.button6);
        goToMainActivity.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                if(g.equals("toMain")){
                Intent i=new Intent(InformationActivity.this,MainActivity.class);
                startActivity(i);
            }else{Intent i=new Intent(InformationActivity.this,NeededActivity.class);
                    startActivity(i);}
            }
        });
       goToRegisterActivity.setOnClickListener(new View.OnClickListener() {
           @Override
           public void onClick(View v) {
               Intent i=new Intent(InformationActivity.this,Enable_GPS.class);
               i.putExtra("k",g2);
               i.putExtra("return",g);
               startActivity(i);
           }
       });
       goToSettingActivity.setOnClickListener(new View.OnClickListener() {
           @Override
           public void onClick(View v) {
               Intent i=new Intent(InformationActivity.this,SettingActivity.class);
               i.putExtra("k",g2);
               i.putExtra("return",g);
               startActivity(i);
           }
       });



//TabLayout t=findViewById(R.id.tabs);
//t.addOnTabSelectedListener(new TabLayout.OnTabSelectedListener() {
//    @Override
//    public void onTabSelected(TabLayout.Tab tab) {
//        int f=tab.getPosition();
//        if(f==0) {
//            Toast.makeText(InformationActivity.this, "Hee", Toast.LENGTH_LONG).show();
//
//        }
//    }
//
//    @Override
//    public void onTabUnselected(TabLayout.Tab tab) {
//
//    }
//
//    @Override
//    public void onTabReselected(TabLayout.Tab tab) {
//
//    }
//});
//    }


}}